# **Pandas 01**

# **#01 : Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame**

# Import Modules

In [1]:
#Import modul PANDAS dengan alias 'pd'
import pandas as pd
#Import modul NUMPY dengan alias 'np'
import numpy as np

#Mencetak versi pandas dan numpy menggunakan alias(pd) dan (np) __version__ 
print(pd.__version__)
print(np.__version__)

2.1.1
1.24.2

# **Persiapan Data Frame**

In [2]:
n_rows = 5 #Mengatur jumlah BARIS pada Data Frame
n_cols = 5 #Mengatur jumlah KOLOM pada Data Frame

#Membuat tuple yang berisi nama-nama kolom ('A','B','C','D','E')
cols = tuple('ABCDE')

#Membuat DataFrame dengan nilai random antara 1 - 10
#Ukuran DataFrame ditentukan (n_rows x n_cols)
#Memberi nama kolom sesuai dengan tuple 'cols' 
df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns = cols) 

df #Mencetak DataFrame yang telah dibuat

   A  B  C  D  E
0  3  5  3  3  5
1  7  8  2  1  9
2  3  7  3  6  5
3  4  3  2  7  9
4  2  6  8  5  2

In [3]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

# **Menyertakan Prefix Kolom**

In [4]:
# Menambahkan awalan 'kolom_' ke setiap label kolom dalam data frame menggunakan metode add_prefix
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        3        5        3        3        5
1        7        8        2        1        9
2        3        7        3        6        5
3        4        3        2        7        9
4        2        6        8        5        2

menambahkan Prefix yaitu menambahkan string didepan string tertentu

# **Menyertakan Suffix Kolom**

In [5]:
# Menambahkan awalan 'field_' ke setiap label kolom dalam data frame menggunakan metode add_prefix
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        3        5        3        3        5
1        7        8        2        1        9
2        3        7        3        6        5
3        4        3        2        7        9
4        2        6        8        5        2

Sufix merupakan sekumpulan string di bagian belakang

# **#02: Pemilihan baris (rows selection) pada Data Frame**

# **Persiapan Data Frame**

In [6]:
#Menentukan jumlah baris dan kolom untuk data frame
n_rows = 10
n_cols = 5

#Menentukan label kolom menggunakan tuple 
cols = tuple('ABCDE')

#Membuat data frame dengan nilai acak antara 1 dan 5
df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns = cols) 

#Menampilkan data frame yang telah dibuat 
df

   A  B  C  D  E
0  4  2  4  3  3
1  1  3  2  2  1
2  3  1  1  1  4
3  1  3  2  1  1
4  1  1  2  1  3
5  4  2  1  4  4
6  1  1  1  2  2
7  1  2  1  4  4
8  3  2  4  1  4
9  3  1  2  2  3

# **Selection dengan operator logika |**

In [7]:
# Memilih baris dalam data frame di mana nilai kolom 'A' sama dengan 1 atau 3
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  1  3  2  2  1
2  3  1  1  1  4
3  1  3  2  1  1
4  1  1  2  1  3
6  1  1  1  2  2
7  1  2  1  4  4
8  3  2  4  1  4
9  3  1  2  2  3

# Selection dengan fungsi **isin()**

In [8]:
# Memilih baris dalam data frame di mana nilai kolom 'A' terdapat dalam daftar [1, 3]
df[df['A'].isin([1, 3])]

   A  B  C  D  E
1  1  3  2  2  1
2  3  1  1  1  4
3  1  3  2  1  1
4  1  1  2  1  3
6  1  1  1  2  2
7  1  2  1  4  4
8  3  2  4  1  4
9  3  1  2  2  3

# **Mengenal Operator negasi ~**

Operator negasi ~ digunakan sebagai operator logika untuk membuat kebalikan dari suatu kondisi.


Ketika digunakan dengan kondisi boolean, ~ akan menghasilkan nilai kebalikan dari kondisi tersebut.

In [9]:
# Memilih baris dalam data frame di mana nilai kolom 'A' tidak terdapat dalam daftar [1, 3]
df[-df['A'].isin([1, 3])]

   A  B  C  D  E
0  4  2  4  3  3
5  4  2  1  4  4

# **#03 Konversi tipe data String ke Numerik pada kolom Data Frame**

# **Persiapan Data Frame**

In [10]:
# Membuat data dictionary untuk pembuatan data frame dengan dua kolom, 'col1' dan 'col2'
data = {'col1':['1', '2', '3', 'teks'],
        'col2':['1', '2', '3', '4']} 

# Membuat data frame dari data dictionary yang telah dibuat
df = pd.DataFrame(data)

# Menampilkan data frame yang telah dibuat
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [11]:
# Menggunakan atribut dtypes pada data frame untuk menampilkan tipe data dari setiap kolom
df.dtypes

col1    object
col2    object
dtype: object

# Konversi tipe data dengan fungsi **astype()**

In [12]:
# Menggunakan metode astype untuk mengubah tipe data kolom 'col2' menjadi integer
df_x = df.astype({'col2':'int'})

# Menampilkan data frame yang telah diubah tipe datanya
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [13]:
# Menggunakan atribut dtypes pada data frame df_x untuk menampilkan tipe data dari setiap kolom
df_x.dtypes

col1    object
col2     int32
dtype: object

# Konversi tipe data numerik dengan fungsi **to_numeric()**

In [14]:
# Mengubah seluruh nilai dalam data frame menjadi numerik
# Mengubah nilai non-numerik menjadi Not A Number
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

# **#4 Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data**

# **Persiapan Data Frame**

In [15]:
# Menentukan jumlah baris dan kolom serta label kolom untuk data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

# Membuat data frame dengan nilai acak antara 1 dan 20, dengan kolom 'bil_pecahan' diubah menjadi tipe data float
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

# Mengatur indeks data frame menggunakan rentang waktu per jam mulai dari '2023-10-01'
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='H') 

# Mengatur ulang indeks menjadi kolom biasa
df = df.reset_index()

# Menambahkan kolom 'teks' dengan nilai 'A', 'B', 'C', 'D', 'E' ke dalam data frame
df['teks'] = list('ABCDE')

# Menampilkan data frame yang telah dibuat
df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00         13.0         15    A
1 2023-10-01 01:00:00          4.0         16    B
2 2023-10-01 02:00:00          4.0         15    C
3 2023-10-01 03:00:00          4.0          6    D
4 2023-10-01 04:00:00         18.0         11    E

In [16]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# **Memilih kolom bertipe data numerik**

In [17]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         13.0         15
1          4.0         16
2          4.0         15
3          4.0          6
4         18.0         11

In [18]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data float
df.select_dtypes(include='float')

   bil_pecahan
0         13.0
1          4.0
2          4.0
3          4.0
4         18.0

In [19]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data integer
df.select_dtypes(include='int')

   bil_bulat
0         15
1         16
2         15
3          6
4         11

# Memilih kolom bertipe data string atau **object**

In [20]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data objek (biasanya string atau data non-numeric)
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih kolom bertipe data string atau **datetime**

In [21]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data datetime
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

# Memilih kolom dengan kombinasi tipe data

In [22]:
# Memilih kolom-kolom dalam data frame yang memiliki tipe data numerik atau objek (non-numeric)
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         13.0         15    A
1          4.0         16    B
2          4.0         15    C
3          4.0          6    D
4         18.0         11    E